package Lesson_6

fun main() {

    val secondsRequest - null
    println("Введите количество секунд которые нужно засечь")
    while

    val secondsRequest = readLine().toInt()
            секунды истекли
    println("Прошло N секунд”)
            пауза


}

/*
Создай простой таймер, который запрашивает у пользователя количество секунд, которые нужно засечь. По истечении
заданного времени, выведется сообщение в консоли: “Прошло N секунд”. Где N – количество секунд, введенных пользователем.
Программа должна вставать на паузу.

 */