package Lesson_7

fun main() {


    генерируем код для смс из 4 цифр
    выводим его в консоль Ваш код авторизации
    Далее программа запрашивает ввод в консоль чтобы авторизоватся
            если не верно - программа вышлет новый (отобразит в консоли) и снова будет запрашивать его ввод для попытки
    авторизации. Если код введен верно – программа отображает приветствие и завершает работу.

}
/*
Задача 2 к Уроку 7

Создай программу, имитирующую авторизацию по коду из смс. Программа будет “высылать” код из четырех цифр (случайное
число от 1000 до 9999). Выведи его в консоль с текстом “Ваш код авторизации: N”. Далее программа запрашивает ввод кода,
чтобы авторизоваться.

Если код введён неверно – программа вышлет новый (отобразит в консоли) и снова будет запрашивать его ввод для попытки
авторизации. Если код введен верно – программа отображает приветствие и завершает работу.
 */